aaron-bond.better-comments
adpyke.codesnap
ajshort.include-autocomplete
alefragnani.bookmarks
andenetalexander.vim-cheatsheet
antfu.iconify
aykutsarac.jsoncrack-vscode
batisteo.vscode-django
be5invis.vscode-custom-css
bradlc.vscode-tailwindcss
brandonfowler.exe-runner
brandonkirbyson.vscode-animations
christian-kohler.path-intellisense
circlecodesolution.ccs-flutter-color
continue.continue
danielpinto8zz6.c-cpp-compile-run
darkriszty.markdown-table-prettify
davidanson.vscode-markdownlint
donjayamanne.githistory
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
franneck94.c-cpp-runner
frhtylcn.pythonsnippets
github.codespaces
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
graykode.ai-docstring
gruntfuggly.todo-tree
hoovercj.vscode-power-mode
ibm.output-colorizer
ionutvmi.path-autocomplete
jeff-hykin.better-cpp-syntax
josemurilloc.aura-spirit-dracula
jwwylar.python-visualizer
kevinkyang.auto-comment-blocks
kevinrose.vsc-python-indent
liamhammett.inline-parameters
lihui.vs-color-picker
magicstack.magicpython
manim-notebook.manim-notebook
marcel-goldschen-ohm.manim-viewer
markosth09.color-picker
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.live-server
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
njpwerner.autodocstring
orta.vscode-jest
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
rickaym.manim-sideview
ritwickdey.liveserver
rvest.vs-code-prettier-eslint
shd101wyy.markdown-preview-enhanced
sidthesloth.html5-boilerplate
spywhere.guides
steoates.autoimport
streetsidesoftware.code-spell-checker
subframe7536.custom-ui-style
thang-nm.catppuccin-perfect-icons
thomaz.preparing
tonybaloney.vscode-pets
tushortz.python-extended-snippets
usernamehw.errorlens
vader-sama.sharingan
vadimcn.vscode-lldb
vintharas.learn-vim
vscodevim.vim
wakatime.vscode-wakatime
wallabyjs.quokka-vscode
wholroyd.jinja
wix.vscode-import-cost
wscats.html-snippets
xabikos.javascriptsnippets
yzhang.markdown-all-in-one
zignd.html-css-class-completion
zykowal.editor-cursor-animation

